org/20231215T101410--create-a-blog-with-emacs-easy-hugo__emacs_hugo_websites.org
#+title:      create a blog with emacs-easy-hugo
#+date:       [2023-12-15 Fri 10:14]
#+filetags:   :emacs:hugo:websites:
#+identifier: 20231215T101410
#+STARTUP:    overview

Here is how you create a blog simply with Hugo - [[file:20231128T133020--create-a-blog-with-hugo__hugo_websites.org][example]]. Unless you like to
write outside Emacs and you like wiring in plain Markdown - go ahead and create
a blog with hugo.

If you want to use Emacs, write in .org syntax AND publish your blog HUGO
STYLE, then there is a package for you -
https://github.com/masasam/emacs-easy-hugo. Heard about it here -
https://youtu.be/7s8cQ2cOnl8?si=NaOv-2uyv74PmZo6&t=1708

And here -
https://gtpedrosa.github.io/blog/using-org-mode-and-ox-hugo-to-replace-markdown-in-hugo-workflow/

Have not tried it myself yet(yes, might seem strange, will I might do that in
the future, now simply keeping this as a reference for myself later.
[2023-12-15 Fri] and I am quite happy with my fresh out of the over devnotes
page(the one you are on now.)), I don't really want another dependency managing
my LIFE LONG notes. If it's just for a simple blog that you want to spin up on
the spot, then probably that could work.

https://github.com/kaushalmodi/ox-hugo?tab=readme-ov-file
