html/20231215T101410--create-a-blog-with-emacs-easy-hugo__emacs_hugo_websites.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-20 Wed 08:50 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>create a blog with emacs-easy-hugo</title>
<meta name="author" content="Arvydas Gasparavicius" />
<meta name="description" content="welcome to my site" />
<meta name="keywords" content="emacs antanas geles" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../static/css/org-html-style-default.css" type="text/css"/>
<link rel="stylesheet" href="../static/css/generic.css" type="text/css"/>
<link rel="stylesheet" href="../static/css/taingram.css" type="text/css"/>
<link rel="stylesheet" href="../static/css/lightbox.css" type="text/css"/>
<link rel="stylesheet" href="../static/css/scroll-to-top.css" type="text/css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="sitemap.html">NOTES </a>
 
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="preamble" class="status">
<div id="updated">Updated: 2023-12-15 Fri 22:36</div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">create a blog with emacs-easy-hugo</h1>
</header><p>
Here is how you create a blog simply with Hugo - <a href="20231128T133020--create-a-blog-with-hugo__hugo_websites.html">example</a>. Unless you like to
write outside Emacs and you like wiring in plain Markdown - go ahead and create
a blog with hugo.
</p>

<p>
If you want to use Emacs, write in .org syntax AND publish your blog HUGO
STYLE, then there is a package for you -
<a href="https://github.com/masasam/emacs-easy-hugo">https://github.com/masasam/emacs-easy-hugo</a>. Heard about it here -
<a href="https://youtu.be/7s8cQ2cOnl8?si=NaOv-2uyv74PmZo6&amp;t=1708">https://youtu.be/7s8cQ2cOnl8?si=NaOv-2uyv74PmZo6&amp;t=1708</a>
</p>

<p>
And here -
<a href="https://gtpedrosa.github.io/blog/using-org-mode-and-ox-hugo-to-replace-markdown-in-hugo-workflow/">https://gtpedrosa.github.io/blog/using-org-mode-and-ox-hugo-to-replace-markdown-in-hugo-workflow/</a>
</p>

<p>
Have not tried it myself yet(yes, might seem strange, will I might do that in
the future, now simply keeping this as a reference for myself later.
<span class="timestamp-wrapper"><span class="timestamp">[2023-12-15 Fri] </span></span> and I am quite happy with my fresh out of the over devnotes
page(the one you are on now.)), I don't really want another dependency managing
my LIFE LONG notes. If it's just for a simple blog that you want to spin up on
the spot, then probably that could work.
</p>

<p>
<a href="https://github.com/kaushalmodi/ox-hugo?tab=readme-ov-file">https://github.com/kaushalmodi/ox-hugo?tab=readme-ov-file</a>
</p>
</div>
<div id="postamble" class="status">
<hr/>
	 <footer>
	 <div class="copyright-container">
	 <div class="copyright">
	 Copyright &copy; 2023-2023 Arvydas Gasparavicius
	 </div>
	 </div>
	 <p class="date">This org file is created: 2023-12-15 Fri 10:14</p>
	 <p class="date">This org file is last modified: 2023-12-15 Fri 22:36</p>
	 <p class="date">This org file is exported to HTML: 2023-12-20 Wed 08:50</p>
	 <div class="generated">
	Created with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6) on <a href="https://www.gnu.org">GNU</a>/<a href="https://www.kernel.org/">Linux</a>
	</div>
	</footer>
	 <button onclick="topFunction()" id="myBtn" title="Go to top">Top</button>
	 <script src="../static/js/generic.js"></script>
	 <script src="../static/js/scroll-to-top.js"></script>
	 <script src="../static/js/lightbox.js"></script>
</div>
</body>
</html>